const aboutMe = {
  introduction: "안녕하세요 이윤슬입니다.😊 \n 4년간 QA 엔지니어로 근무하며 웹·모바일 서비스의 품질과 안정성을 검증해왔고 UI/UX, 기능 흐름, 예외 케이스 등을 테스트하며 문제를 조기에 발견하고 개선하는 데 집중해왔습니다. 기획자, 디자이너, 개발자 등 유관 부서와의 협업을 통해 이슈를 명확히 전달하고 재현 환경을 구성하며 이 과정에서 사용자 경험을 개선할 수 있는 개발 자체에 관심을 가지게 되었고 직접 서비스를 구현하기 위해 프론트엔드 개발자가 되었습니다.  ",
  details: [
    "React와 TypeScript를 중심으로 다양한 프로젝트를 진행하며 상태 관리는 대부분 Zustand를 사용하였습니다. 페이지별 상태 구조에 맞춘 스토어 설계와 구조적 일관성을 유지하였으며 비동기 데이터 처리에는 React Query를 활용하여 API 캐싱, 에러 및 로딩 상태 관리하여 사용자 경험을 위한 기능을 구현했습니다. ",
    "컴포넌트 단위 개발을 중시하며 UI 요소를 디자인 시스템 형태로 정리하고 버튼·레이아웃 등을 공통 컴포넌트로 추상화해 다양한 상황에서 재사용 가능한 구조로 구성했습니다.\n",
    "팀 프로젝트에서는 Git flow 기반의 브랜치 전략을 활용해 협업 구조를 정리하고 코드 리뷰 및 역할 분담을 통해 일정 내에 안정적인 결과물을 도출한 경험이 있습니다. 이외에도 이슈를 명확히 기록하고 정리하는 습관을 통해 팀 내 커뮤니케이션을 원활하게 만드는 데 기여했습니다. ",
    "앞으로도 사용자에게 의미 있는 경험을 제공하는 UI를 만들고 팀과 함께 성장할 수 있는 프론트엔드 개발자가 되겠습니다." ,
  ],
};

export default aboutMe;