const aboutMe = {
  introduction: "안녕하세요 이윤슬입니다.😊 \n 4년간 QA 엔지니어로서 소프트웨어의 품질과 안정성을 검증하며 체계적인 테스트 및 품질 개선을 주도해 왔습니다. \n  이 과정에서 웹 기술과 사용자 경험(UX)에 대해 관심을 가지게 되었고 직접 개발을 통해 사용자에게 최적의 경험을 제공하고자 프론트엔드 개발자로 전환하게 되었습니다. ",
  details: [
    "React, JavaScript, TypeScript, HTML, CSS 등 최신 프론트엔드 기술을 학습하고 웹 애플리케이션 개발 과정에서 성능 최적화, 상태 관리 등 실무 경험을 쌓았습니다. \n",
    "주요 프로젝트는 [FansPick], [vite-plugin-optimize-image], [PETPLE]이 있습니다. 이를 통해 UI/UX 설계 컴포넌트 기반 개발과 API 연동 등 역량을 강화하였습니다.\n",
    "QA 엔지니어로서의 경험을 바탕으로 테스트 자동화 및 품질 보증 전략을 고려한 안정적이고 유지보수 가능한 코드 작성에 주력하고 있습니다. ",
    "프론트엔드 개발자로서 기술적 완성도를 높이고 사용자 중심의 인터랙션 설계와 성능 최적화에 집중하여 보다 직관적이고 효율적인 웹 애플리케이션을 개발하는 것이 목표입니다. 지속적인 학습과 협업을 통해 성장하는 개발자가 되겠습니다."
  ],
};

export default aboutMe;